back-end/app/controllers/patients_controller.rb

  def login
    patient = Patient.find_by(email: params[:email])
---
SELECT "patients".* FROM "patients" WHERE "patients"."email" IS NULL LIMIT ?  [["LIMIT", 1]]